[Samurai X2SoldierClassTemplate]
+DisplayName="Samurai"
+ClassSummary="The way of the samurai is found in death. Meditation on inevitable death should be performed daily. Every day when one's body and mind are at peace, one should meditate upon being ripped apart by arrows, rifles, spears and swords, being carried away by surging waves, being thrown into the midst of a great fire, being struck by lightning, being shaken to death by a great earthquake, falling from thousand-foot cliffs, dying of disease or committing seppuku at the death of one's master. And every day without fail one should consider himself as dead. This is the substance of the way of the samurai."
+LeftAbilityTreeTitle="Kensai"
+RightAbilityTreeTitle="Ronin"
AbilityTreeTitles[0]="Kensai"
AbilityTreeTitles[1]="Shugendo"
AbilityTreeTitles[2]="Ronin"

+RandomNickNames[0]="Kensai"
+RandomNickNames[1]="Ronin"
+RandomNickNames[2]="Shogun"
+RandomNickNames[3]="Slice"
+RandomNickNames[4]="Cherry Blossom"
+RandomNickNames[5]="Bokken"
+RandomNickNames[6]="Zen"
+RandomNickNames[7]="Blade"
+RandomNickNames[8]="Mountain Storm"
+RandomNickNames[9]="Heavy Rain"
+RandomNickNames[10]="Cloud Dancer"
+RandomNickNames[11]="Grass Cutter"
+RandomNickNames[12]="Honor"
+RandomNickNames[13]="Sudden Death"
+RandomNickNames[14]="Stalker"
+RandomNickNames[14]="Bushido"

[SamuraiTacticalRigging X2AbilityTemplate]
LocFriendlyName="Tactical Rigging"
LocHelpText="Provides an additional utility slot, provided the soldier's armor does not already provide one."
LocLongDescription="Provides an additional utility slot, provided the soldier's armor does not already provide one."
LocPromotionPopupText="<Bullet/> Increase this soldier's versatility by equipping an extra grenade, ammo type, or vest.<br/>"

[HawkEye X2AbilityTemplate]
LocFriendlyName="Hawkeye"
LocLongDescription="According to what one of the elders said, taking an enemy on the battlefield is like a hawk taking a bird. Even though it enters into the midst of a thousand of them, it gives no attention to any bird than the one it first marked.<br/>Grants +15 critical hit chance and +3 critical damage for melee attacks"
LocHelpText="Grants +15 critical hit chance and +3 critical damage for melee attacks"
LocFlyOverText="Hawkeye" 
LocPromotionPopupText="<Bullet/>+ 15% critical hit chance in melee<br/><Bullet/>+ 3 critical damage in melee<br/>"

[WayOfTheSamurai X2AbilityTemplate]
LocFriendlyName="Way of the Samurai"
LocLongDescription="The Way of the Samurai is found in death. Meditation on inevitable death should be performed daily.<br/>The intensive swordtraining adds +3 damage and +10 hit chance with melee weapons."
LocHelpText="+3 damage and +10 hit chance with swords"
LocFlyOverText="Way of the Samurai" 
LocPromotionPopupText="<Bullet/>The intensive swordtraining adds +3 damage and +10 hit chance with melee weapons."

[Unstoppable X2AbilityTemplate]
LocFriendlyName="Unstoppable"
LocLongDescription="In the words of the ancients, one should make his decision within the space of seven breaths.<br/>It is a matter of being determined and having the spirit to break through to the other side.<br/>Melee attacks never graze"
LocHelpText="Melee attacks never graze. Try to counter that you pesky mutons!"
LocFlyOverText="Unstoppable" 
LocPromotionPopupText="<Bullet/>Melee attacks never graze."

[MeleeShredder X2AbilityTemplate]
LocFriendlyName="Energy Focus"
LocLongDescription="SHUCHU RYOKU - Focus all your energy to one point! Adds shredder damage to you melee attacks"
LocHelpText="Adds shredder damage to you melee attacks"
LocFlyOverText="Energy Focus" 
LocPromotionPopupText="<Bullet/>Grants 1 shred for first tier swords<br/><Bullet/>Grants 2 shred for second tier swords<br/><Bullet/>Grants 3 shred for third tier swords"

[WhirlwindStrike X2AbilityTemplate]
LocFriendlyName="Whirlwind Strike"
LocLongDescription="The Way of the Samurai is one of immediacy, and it is best to dash in headlong.<br/>Perfom two slashes at the target. Each has an aim penalty of -15.<br/>No cooldown.<br/>Consumes 1 focus point."
LocHelpText="Perfom two slashes at the target. Each has an aim penalty of -15.<br/>Consumes 1 focus point."
LocFlyOverText="Perfom two slashes at the target. Each has an aim penalty of -15.<br/>Consumes 1 focus point." 
LocPromotionPopupText="<Bullet/>Perfom two slashes at the target. Each has an aim penalty of -15.<br/><Bullet/>No cooldown.<br/><Bullet/>Consumes 1 focus point."

[TrainingDiscipline X2AbilityTemplate]
LocFriendlyName="Training Discipline"
LocLongDescription="<i>True strength is the flower of Wisdom, but its seed is action.<i/><br/>The Samurais relentless training provides +3 mobilty and +20 dodge."
LocHelpText="The Samurais relentless training provides +3 mobilty and +20 dodge."
LocFlyOverText="Training Discipline" 
LocPromotionPopupText="<Bullet>Grants +3 mobilty<br/><Bullet/>Grants +20 dodge"

[Yamabushi X2AbilityTemplate]
LocFriendlyName="Yamabushi Heritage"
LocLongDescription="<i>The Shugendo disciples search for spiritual, mystical, or supernatural powers gained through asceticism<i/>You are strong as the montain and gain +1 armor, +15 defense and can regenerate 2 HP per round, max to 6 HP."
LocHelpText="You are strong as the montain and gain +1 armor, +15 defense and can regenerate 2 HP per round, max to 6 HP"
LocFlyOverText="Yamabushi Heritage" 
LocPromotionPopupText="<Bullet>Grants + 2 armor<br/><Bullet/>Grants +15 defense<br/><Bullet/>Regenerate 2 HP per round, max to 6 HP"

[DragonStrike X2AbilityTemplate]
LocFriendlyName="Dragon Strike"
LocLongDescription="Reason will not decide at last; the sword will decide! Unleash a terrible strike upon your enemy, that does aoe damage and can disorient survivers. Consumes 1 focus point."
LocHelpText="Unleash a terrible strike upon your enemy, that does aoe damage and can disorient survivers. Consumes 1 focus point."
LocFlyOverText="Dragon Strike" 
LocPromotionPopupText="<Bullet>5 meter radius aoe melee attack<br/><Bullet/><Ability:SelfCooldown/> Cooldown<br/><Bullet/>Consumes 1 focus."

[DangerSense X2AbilityTemplate]
LocFriendlyName="Danger Sense"
LocLongDescription="You should be calm outside, but keep your mind alert and prepared. The Samurais keen danger sense tracks movement 20 meters around him. He cannot be surprised be faceless or burrowed chryssalids."
LocHelpText="Dairokkan, the Samurais keen danger sense tracks movement 20 meters around him. He cannot be surprised be faceless or burrowed chryssalids."
LocFlyOverText="Danger Sense"
LocPromotionPopupText="<Bullet/>Tracks movement within 20 meters. Can't be surprised be faceless or burrowed chryssalids<br/>"

[SamuraiFrenzy X2AbilityTemplate]
LocFriendlyName="Shigurui"
LocLongDescription="Even if one's head were to be suddenly cut off, he should be able to do one more action with certainty. With martial valor, if one becomes like a revengeful ghost and shows great determination, though his head is cut off, he should not die.<br/>When the Samurai is wounded in battle he enters a death frenzy state and gets 1 additional action point, +80 dodge and +50 crit chance in melee for 2 rounds."
LocHelpText="Shigurui - when the Samurai is wounded in battle he enters a death frenzy state and gets 1 additional action point, +80 dodge and +50 crit chance in melee for 2 rounds."
LocFlyOverText="Shigurui Death Frenzy"
LocPromotionPopupText="<Bullet/>When wounded get 1 additional action point<br/><Bullet/>+80 dodge<br/><Bullet/>+50 crit chance in melee<br/><Bullet/>lasts 2 rounds"

[Shinigami X2AbilityTemplate]
LocFriendlyName="Shinigami"
LocLongDescription="\"Today i become death\" Our scientists are not entirely sure why the Samurai is so much faster than our regular soldiers. They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocHelpText="They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocFlyOverText="Shinigami"
LocPromotionPopupText="<Bullet/>They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus.<br/><Bullet/>For every 10 souls you collect in total you gain +1 critical chance and for every 20 souls +1 critical damage.<br/>"

[SamuraiSoulSteal X2AbilityTemplate]
LocFriendlyName="Shinigami Focus"
LocLongDescription="\"Today i become death\" Our scientists are not entirely sure why the Samurai is so much faster than our regular soldiers. They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocHelpText="They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocFlyOverText="Shinigami Focus"
LocPromotionPopupText="<Bullet/>They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus.<br/><Bullet/>For every 10 souls you collect in total you gain +1 critical chance and for every 20 souls +1 critical damage.<br/>"

[SamuraiSoulStealConsumeSoul X2AbilityTemplate]
LocFriendlyName="Shinigami"
LocLongDescription="\"Today i become death\" Our scientists are not entirely sure why the Samurai is so much faster than our regular soldiers. They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocHelpText="They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus."
LocFlyOverText="Shinigami"
LocPromotionPopupText="<Bullet/>They say its a psionic ability that absorbs the energy of his fallen enemies. Each time the Samurai kills in melee he gains 1 focus point. When activated none of your melee attacks are turn ending. Activation consumes 2 focus.<br/><Bullet/>For every 10 souls you collect in total you gain +1 critical chance and for every 20 souls +1 critical damage.<br/>"

[SamuraiCoupDeGrace X2AbilityTemplate]
LocFriendlyName="Coup de Grâce"
LocFlyOverText="Coup de Grâce"
LocLongDescription="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned or panicking enemy."
LocHelpText="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned, or panicking  enemy."
LocPromotionPopupText="<Bullet/> Coup de Grâce grants +50 aim, +50 critical chance and +2 damage against stunned and panicking enemies.<br/><Bullet/> The bonuses are reduced against disoriented enemies."

[SamuraiCutthroat X2AbilityTemplate]
LocFriendlyName="Cutthroat"
LocFlyOverText="Cutthroat"
LocLongDescription="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocHelpText="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocPromotionPopupText="<Bullet/> Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."

[SwordThrust X2AbilityTemplate]
LocFriendlyName="Sword Thrust"
LocFlyOverText="Sword Thrust"
LocLongDescription="Special melee attack that pierces most armor and applies rupture to the target. Consumes 1 focus point."
LocHelpText="Special melee attack that pierces most armor and applies rupture to the target.. Consumes 1 focus point."
LocPromotionPopupText="<Bullet/>5 armor pierce<br/><Bullet/>4 rupture<br/><Bullet/>3 turn cooldown<br/><Bullet/>. Consumes 1 focus point."
